Tekla Open API Reference for Tekla Structures 2025
CylindricalSurfaceNode.Surface Property
 Gets the cylindrical surface geometry.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CylindricalSurface Surface { get; }
Public ReadOnly Property Surface As CylindricalSurface
	Get
Property Value
Type: CylindricalSurface
See Also
Reference
CylindricalSurfaceNode Class
Tekla.Structures.Model Namespace